espressif/esp-idf/components/esp_hal_mcpwm/esp32h4/include/hal/mcpwm_ll.h
/*
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#pragma once

#include <stdio.h>
#include <stdbool.h>
#include "soc/soc_caps.h"
#include "soc/mcpwm_struct.h"
#include "soc/clk_tree_defs.h"
#include "soc/pcr_struct.h"
#include "hal/mcpwm_types.h"
#include "hal/misc.h"
#include "hal/assert.h"
#include "soc/soc_etm_source.h"

#ifdef __cplusplus
extern "C" {
#endif

// MCPWM LL get macro
#define MCPWM_LL_GET(attr)                   (MCPWM_LL_ ## attr)

// Get MCPWM group register base address
#define MCPWM_LL_GET_HW(ID)                  (((ID) == 0) ? &MCPWM0 : &MCPWM1)

// MCPWM capabilities
#define MCPWM_LL_GROUP_NUM                         (2) ///< 2 MCPWM groups on the chip (i.e., the number of independent MCPWM peripherals)
#define MCPWM_LL_TIMERS_PER_GROUP                  (3)  ///< The number of timers that each group has
#define MCPWM_LL_OPERATORS_PER_GROUP               (3)  ///< The number of operators that each group has
#define MCPWM_LL_COMPARATORS_PER_OPERATOR          (2)  ///< The number of comparators that each operator has
#define MCPWM_LL_GENERATORS_PER_OPERATOR           (2)  ///< The number of generators that each operator has
#define MCPWM_LL_EVENT_COMPARATORS_PER_OPERATOR    (2)  ///< The number of event comparators that each operator has
#define MCPWM_LL_TRIGGERS_PER_OPERATOR             (2)  ///< The number of triggers that each operator has
#define MCPWM_LL_GPIO_FAULTS_PER_GROUP             (3)  ///< The number of fault signal detectors that each group has
#define MCPWM_LL_CAPTURE_TIMERS_PER_GROUP          (1)  ///< The number of capture timers that each group has
#define MCPWM_LL_CAPTURE_CHANNELS_PER_TIMER        (3)  ///< The number of capture channels that each capture timer has
#define MCPWM_LL_GPIO_SYNCHROS_PER_GROUP           (3)  ///< The number of GPIO synchros that each group has

// MCPWM interrupt event mask
#define MCPWM_LL_EVENT_TIMER_STOP(timer)     (1 << (timer))
#define MCPWM_LL_EVENT_TIMER_EMPTY(timer)    (1 << ((timer) + 3))
#define MCPWM_LL_EVENT_TIMER_FULL(timer)     (1 << ((timer) + 6))
#define MCPWM_LL_EVENT_TIMER_MASK(timer)     (MCPWM_LL_EVENT_TIMER_STOP(timer) | MCPWM_LL_EVENT_TIMER_EMPTY(timer) | MCPWM_LL_EVENT_TIMER_FULL(timer))
#define MCPWM_LL_EVENT_FAULT_ENTER(fault)    (1 << ((fault) + 9))
#define MCPWM_LL_EVENT_FAULT_EXIT(fault)     (1 << ((fault) + 12))
#define MCPWM_LL_EVENT_FAULT_MASK(fault)     (MCPWM_LL_EVENT_FAULT_ENTER(fault) | MCPWM_LL_EVENT_FAULT_EXIT(fault))
#define MCPWM_LL_EVENT_CMP_EQUAL(oper, cmp)  (1 << ((oper) + (cmp) * 3 + 15))
#define MCPWM_LL_EVENT_OPER_BRAKE_CBC(oper)  (1 << ((oper) + 21))
#define MCPWM_LL_EVENT_OPER_BRAKE_OST(oper)  (1 << ((oper) + 24))
#define MCPWM_LL_EVENT_OPER_MASK(oper)       (MCPWM_LL_EVENT_OPER_BRAKE_CBC(oper) | MCPWM_LL_EVENT_OPER_BRAKE_OST(oper))
#define MCPWM_LL_EVENT_CAPTURE(cap)          (1 << ((cap) + 27))

// Maximum values due to limited register bit width
#define MCPWM_LL_MAX_GROUP_PRESCALE          256
#define MCPWM_LL_MAX_TIMER_PRESCALE          256
#define MCPWM_LL_MAX_CARRIER_PRESCALE        16
#define MCPWM_LL_MAX_CARRIER_ONESHOT         16
#define MCPWM_LL_MAX_CAPTURE_PRESCALE        256
#define MCPWM_LL_MAX_CAPTURE_TIMER_PRESCALE  1
#define MCPWM_LL_MAX_DEAD_DELAY              65536
#define MCPWM_LL_MAX_COUNT_VALUE             65536

// translate the HAL types into register values
#define MCPWM_LL_TIMER_EVENT_TO_REG_VAL(event) ((uint8_t[]) {0, 1}[(event)])
#define MCPWM_LL_GEN_ACTION_TO_REG_CAL(action) ((uint8_t[]) {0, 1, 2, 3}[(action)])
#define MCPWM_LL_BRAKE_MODE_TO_REG_VAL(mode)  ((uint8_t[]) {0, 1}[(mode)])

// MCPWM ETM comparator event table
#define MCPWM_LL_ETM_COMPARATOR_EVENT_TABLE(group, oper_id, cmpr_id, event)            \
     (uint32_t[2][MCPWM_CMPR_ETM_EVENT_MAX]){                                           \
         {                                                                              \
             [MCPWM_CMPR_ETM_EVENT_EQUAL] = MCPWM0_EVT_OP0_TEA + oper_id + 3 * cmpr_id, \
         },                                                                             \
     }[group][event]

// MCPWM ETM event comparator event table
#define MCPWM_LL_ETM_EVENT_COMPARATOR_EVENT_TABLE(group, oper_id, cmpr_id, event)       \
     (uint32_t[2][MCPWM_CMPR_ETM_EVENT_MAX]){                                            \
         {                                                                               \
             [MCPWM_CMPR_ETM_EVENT_EQUAL] = MCPWM0_EVT_OP0_TEE1 + oper_id + 3 * cmpr_id, \
         },                                                                              \
     }[group][event]

/**
 * @brief The dead time module's clock source
 */
typedef enum {
    MCPWM_LL_DEADTIME_CLK_SRC_GROUP,
    MCPWM_LL_DEADTIME_CLK_SRC_TIMER,
} mcpwm_ll_deadtime_clock_src_t;

////////////////////////////////////////MCPWM Group Specific////////////////////////////////////////////////////////////

/**
 * @brief Enable the bus clock for MCPWM module
 *
 * @param group_id Group ID
 * @param enable true to enable, false to disable
 */
static inline void mcpwm_ll_enable_bus_clock(int group_id, bool enable)
{
    if (group_id == 0) {
        PCR.pwm0_conf.pwm0_clk_en = enable;
    } else {
        PCR.pwm1_conf.pwm1_clk_en = enable;
    }
}

/**
 * @brief Reset the MCPWM module
 *
 * @param group_id Group ID
 */
static inline void mcpwm_ll_reset_register(int group_id)
{
    if (group_id == 0) {
        PCR.pwm0_conf.pwm0_rst_en = 1;
        PCR.pwm0_conf.pwm0_rst_en = 0;
    } else {
        PCR.pwm1_conf.pwm1_rst_en = 1;
        PCR.pwm1_conf.pwm1_rst_en = 0;
    }
}

/**
 * @brief Enable MCPWM function clock
 *
 * @param group_id Group ID
 * @param en true to enable, false to disable
 */
static inline void mcpwm_ll_group_enable_clock(int group_id, bool en)
{
    if (group_id == 0) {
        PCR.pwm0_clk_conf.pwm0_clkm_en = en;
    } else {
        PCR.pwm1_clk_conf.pwm1_clkm_en = en;
    }
}

/**
 * @brief Set the clock source for MCPWM
 *
 * @param group_id Group ID
 * @param clk_src Clock source for the MCPWM peripheral
 */
static inline void mcpwm_ll_group_set_clock_source(int group_id, soc_module_clk_t clk_src)
{
    (void)group_id; // only support MCPWM0
    uint8_t clk_id = 0;
    switch (clk_src) {
    case SOC_MOD_CLK_XTAL:
        clk_id = 0;
        break;
    case SOC_MOD_CLK_RC_FAST:
        clk_id = 1;
        break;
    case SOC_MOD_CLK_PLL_F96M:
        clk_id = 2;
        break;
    default:
        HAL_ASSERT(false);
        break;
    }
    if (group_id == 0) {
        PCR.pwm0_clk_conf.pwm0_clkm_sel = clk_id;
    } else {
        PCR.pwm1_clk_conf.pwm1_clkm_sel = clk_id;
    }
}

/**
 * @brief Set the MCPWM group clock prescale
 *
 * @param group_id Group ID
 * @param prescale Prescale value
 */
static inline void mcpwm_ll_group_set_clock_prescale(int group_id, int prescale)
{
    (void)group_id; // only support MCPWM0
    // group clock: PWM_clk = source_clock / (prescale)
    HAL_ASSERT(prescale <= 256 && prescale > 0);
    if (group_id == 0) {
        HAL_FORCE_MODIFY_U32_REG_FIELD(PCR.pwm0_clk_conf, pwm0_div_num, prescale - 1);
    } else {
        HAL_FORCE_MODIFY_U32_REG_FIELD(PCR.pwm1_clk_conf, pwm1_div_num, prescale - 1);
    }
}

/**
 * @brief Enable update MCPWM active registers from shadow registers
 *
 * @param mcpwm Peripheral instance address
 */
static inline void mcpwm_ll_group_enable_shadow_mode(mcpwm_dev_t *mcpwm)
{
    mcpwm->update_cfg.global_up_en = 1;
    mcpwm->update_cfg.op0_up_en = 1;
    mcpwm->update_cfg.op1_up_en = 1;
    mcpwm->update_cfg.op2_up_en = 1;
}

/**
 * @brief Flush shadow registers to active registers
 *
 * @param mcpwm Peripheral instance address
 */
static inline void mcpwm_ll_group_flush_shadow(mcpwm_dev_t *mcpwm)
{
    // a toggle can trigger a forced update of all active registers in MCPWM, i.e. shadow->active
    mcpwm->update_cfg.global_force_up = 1;
    mcpwm->update_cfg.global_force_up = 0;
}

